Tekla.Structures.Drawing.IMovableRelative
The IMovableRelative interface is implemented by objects that can be moved.

Tekla.Structures.Drawing.IMovableRelative.MoveObjectRelative(Tekla.Structures.Geometry3d.Vector)
Moves the current object using the move vector.
The move vector can be calculated as in the following example.
MoveVector: The move vector to be used for moving the object.
Returns: True on success.
The example calculates a move vector from two points.
The move vector in the example will move an object 1000 points in the +X direction.
using Tekla.Structures.Geometry3d;
public class Example
{
public void Example1()
{
Tekla.Structures.Geometry3d.Vector MoveVec =
new Tekla.Structures.Geometry3d.Vector(new Point(1000, 0) - new Point(0, 0));
}
}